results 8.35.03 PM/bench_10330173/bench_sjf_rate16.log
INFO 09-13 20:05:44 [scheduler.py:216] Chunked prefill is enabled with max_num_batched_tokens=2048.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x1475d9928900>, seed=0, num_prompts=1000, dataset_name='custom', no_stream=False, dataset_path='data/benchmark_prompts.jsonl', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8173, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=16.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/bench_10330173', result_filename='sjf_rate16.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-b5d4047a-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=60, extra_body=None)
Starting initial single prompt test run...
Waiting for endpoint to become up in 60 seconds
 |          | 00:02 elapsed, 70:38:09 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [01:56<00:00,  8.58it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Request rate configured (RPS):           16.00     
Benchmark duration (s):                  116.60    
Total input tokens:                      102199    
Total generated tokens:                  248641    
Request throughput (req/s):              8.58      
Output token throughput (tok/s):         2132.44   
Peak output token throughput (tok/s):    2461.00   
Peak concurrent requests:                492.00    
Total Token throughput (tok/s):          3008.94   
---------------Time to First Token----------------
Mean TTFT (ms):                          25559.13  
Median TTFT (ms):                        3302.64   
P50 TTFT (ms):                           3302.64   
P90 TTFT (ms):                           72928.07  
P95 TTFT (ms):                           82718.19  
P99 TTFT (ms):                           97905.35  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.61     
Median TPOT (ms):                        14.83     
P50 TPOT (ms):                           14.83     
P90 TPOT (ms):                           15.56     
P95 TPOT (ms):                           15.71     
P99 TPOT (ms):                           16.15     
---------------Inter-token Latency----------------
Mean ITL (ms):                           14.59     
Median ITL (ms):                         13.52     
P50 ITL (ms):                            13.52     
P90 ITL (ms):                            15.69     
P95 ITL (ms):                            19.10     
P99 ITL (ms):                            36.58     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          29171.59  
Median E2EL (ms):                        7221.84   
P50 E2EL (ms):                           7221.84   
P90 E2EL (ms):                           76521.30  
P95 E2EL (ms):                           86247.86  
P99 E2EL (ms):                           101339.16 
==================================================